#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_zip: Reading...
module.main.data.archive_file.lambda_zip: Read complete after 0s [id=3356ff90fbe1a99ba1c78dd94c5c78f5ea8af327]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_lambda_function.lambda_function: Refreshing state... [id=lapwing-item-news-dev-lambda]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_iam_policy.scheduler_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]
module.main.aws_scheduler_schedule.invoke_lambda: Refreshing state... [id=lapwing-item-news-dev-scheduler-group/lapwing-item-news-dev-scheduler]
module.main.aws_iam_role_policy_attachment.scheduler: Refreshing state... [id=lapwing-item-news-dev-scheduler-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.main.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lapwing-item-news-dev-lambda"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "project" = "lapwing-item-news"
          + "stage"   = "dev"
        }
    }

  # module.main.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "lapwing-item-news-dev-lambda"
      ~ last_modified                  = "2025-10-04T15:04:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZhMFUsWEiEl/c1HyIdUwajWDSiTt4jPi5B6fvhl/MYE=" -> "AlrHR1nK7AhvDS54rpBKtjKyUFozy6mVRaQeEyxPQpQ="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment the following text.
```
/deploy 18245949472
```